package week11;

public class W11 {

}
//11/20 자바 어플리케이션
//
//비휘발성 보조기억 장치에 ~~~~하는 것이, 우리가 쓰는 파일이라는 용어의 정의이다.
//	파일의 정의와 보조메모리의 저장공간의 구체적인 설명 정보 정리하기
//
//EOF??
//Enter를 치면 EndOfFile신호가 생성된다.
//
//scanf("%s",s)에서 엔터치기전까진 키보드 버퍼에 쌓인다.-->책에 inputStream, outputStream 공부하시오!
//
//메모리는 2차원배열이다...!
//	이미지클래스는 픽셀들의 2차원 배열로 나타내는 기본 클래스이다.
//
//bmf는 손실없는 포멧을 의미하는데, 압축포멧(JPG,PNG)는 약간의 손실을 감안하고 용량을 줄이고, GIF는 엄청난 손실을 감안하고 용량을 엄청나게 줄인다.
//
//IT 뉴스 좀 보고 정보를 긁어 모아라
//
//수업에선 개념을 가르키지만 수준높은코드는 이론이며, 수준 높은 개발자는 이론을 탐구해야한다. 이때 이론학습은 스스로 시행착오를 겪으면서 안다 모른다를 명확히하여 학습해야된다.
//
//언젠가 운영체제를 활용하여 프로세스간 통신(시스템 프로그램)을 구현한다 하자.
//	위 기술은 수강신청 같은 것을 의미한다.
//
//단순 프로그램의 구현(웹페이지 만들기, 프로그램 만들기) 이상으로 결과물이 필요하다.이때 이론을 통해 학습하고 결과물을 만들어라 자신만의 개발이 가능하다.
//
//java awt, swing, 2D, FX
//	awt는 재능기부 차원 느낌으로 조금 무분별하게 만들어짐.
//	그래서 swing으로 정리하여 awt를 보완함
//	여기서 swing에는 없는 내용들을 추가한 2D
//	더 나아가 swing의 시각적인 요소 등을 보완하여 swing의 상위호환 FX
//
//JFormmatedTextField은 정해진 양식의 글만 적을 수 있는 기능

// 김교수님 曰 1 : 난 넘어가지만 여러분은 책을 모두 학습해야한다.
// 김교수님 曰 2 : 나는 단순한 라이브러리 활용에 점수를 주지 않는다. 
//				스스로 구현하는 것이 주요하다. 


